// ============================================================================
// Copyright (C) 2017-2018  All Rights Reserved
// 模块描述: 定时器驱动
// 模块版本: V1.00
// 创建人员: GuXY
// 创建时间: 2017-04-18
// ============================================================================
// 程序修改记录(最新的放在最前面):
// <版本号> <修改日期>, <修改人员>: <修改功能概述>
// ============================================================================

#include "timer.h"
#include "led.h"

// ============================================================================
TIM_HandleTypeDef TIM3_Handler;          //定时器句柄 
extern UINT32 lwip_localtime;	         //lwip本地时间计数器,单位:ms
// ============================================================================
// 函数功能:通用定时器3中断初始化
// 定时器溢出时间计算方法:Tout=((arr+1)*(psc+1))/Ft us.Ft=定时器工作频率,单位:Mhz
// 输入参数:arr：自动重装值,psc：时钟预分频数
// 返 回 值:
// ============================================================================
void TIM3_Init(UINT16 wArr,UINT16 wPsc)
{  
    TIM3_Handler.Instance=TIM3;                           //通用定时器3
    TIM3_Handler.Init.Prescaler=wPsc;                     //分频
    TIM3_Handler.Init.CounterMode=TIM_COUNTERMODE_UP;     //向上计数器
    TIM3_Handler.Init.Period=wArr;                        //自动装载值
    TIM3_Handler.Init.ClockDivision=TIM_CLOCKDIVISION_DIV1;
    HAL_TIM_Base_Init(&TIM3_Handler);
    
    HAL_TIM_Base_Start_IT(&TIM3_Handler); //使能定时器3和定时器3中断   
}

// ============================================================================
// 函数功能:定时器底册驱动，开启时钟，设置中断优先级,HAL_TIM_Base_Init()函数调用
// 输入参数:
// 返 回 值:
// ============================================================================
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
{
    __HAL_RCC_TIM3_CLK_ENABLE();            //使能TIM3时钟
    
    HAL_NVIC_SetPriority(TIM3_IRQn,1,1);    //设置中断优先级，抢占优先级1，子优先级3
    HAL_NVIC_EnableIRQ(TIM3_IRQn);          //开启ITM3中断   
}

// ============================================================================
// 函数功能:定时器3中断服务函数
// 输入参数:
// 返 回 值:
// ============================================================================
void TIM3_IRQHandler(void)
{
    HAL_TIM_IRQHandler(&TIM3_Handler);
}

// ============================================================================
// 函数功能:定时器3中断服务函数调用
// 输入参数:
// 返 回 值:
// ============================================================================
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if(htim==(&TIM3_Handler))
    {
        lwip_localtime +=10; //加10
    }
}

