// ============================================================================
// Copyright (C) 2017-2018  All Rights Reserved
// 模块描述: 定时器驱动
// 模块版本: V1.00
// 创建人员: GuXY
// 创建时间: 2017-04-18
// ============================================================================
// 程序修改记录(最新的放在最前面):
// <版本号> <修改日期>, <修改人员>: <修改功能概述>
// ============================================================================
#ifndef __TIMER_H__
#define __TIMER_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "mySys.h"

void TIM3_Init(u16 arr,u16 psc);


#ifdef __cplusplus
}
#endif


#endif//__TIMER_H__

