// ============================================================================
// Copyright (C) 2017-2018  All Rights Reserved
// 模块描述: 延时处理函数
// 模块版本: V1.00
// 创建人员: GuXY
// 创建时间: 2017-04-18
// ============================================================================
// 程序修改记录(最新的放在最前面):
// <版本号> <修改日期>, <修改人员>: <修改功能概述>
// ============================================================================
#ifndef __DELAY_H__
#define __DELAY_H__

#ifdef __cplusplus
extern "C" {
#endif

#include <mySys.h>	  

// ============================================================================
extern void delay_init( UINT8  bySysClk );
extern void delay_ms  ( UINT16 wMsCnt   );
extern void delay_us  ( UINT32 dwUsCnt  );
// ============================================================================

#ifdef __cplusplus
}
#endif

#endif//__DELAY_H__

